Repository: ocean-Soft287/rehana_dashbored
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Invitations
ar: الدعوات

source: Create Invitation
ar: إنشاء دعوة

source: Add Member
ar: إضافة عضو

source: Add Security Guard
ar: إضافة حارس أمن

source: Account Management
ar: إدارة الحساب

source: User Management
ar: إدارة المستخدمين

# chat
source: Chats
ar: الدردشات

source: Login
ar: تسجيل الدخول

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة السر

source: Did you forget your password?
ar: هل نسيت كلمة المرور؟

# please
source: Please enter your email and password
ar: يرجى إدخال البريد الإلكتروني وكلمة السر

source: Remember me
ar: تذكرني دائمًا

# please_enter_your_email
source: Enter your email
ar: أدخل البريد الإلكتروني

# please_enter_your_password
source: Enter your password
ar: أدخل كلمة السر

source: Villa Number
ar: رقم الفيلا

source: Date
ar: التاريخ

source: Name
ar: الاسم

source: Time
ar: الوقت

source: Reason for Visit
ar: سبب الزيارة

source: Accept
ar: قبول

source: Refuse
ar: رفض

source: Status
ar: الحالة

source: Please enter name
ar: أدخل الاسم

source: Phone
ar: رقم الهاتف

source: Enter phone number
ar: أدخل رقم الهاتف

source: Please enter villa number
ar: أدخل رقم الفيلا

source: Please enter reason for visit
ar: أدخل سبب الزيارة

source: Please enter number of persons
ar: أدخل عدد الأشخاص

# please_select_date
source: Please select a date
ar: يرجى اختيار التاريخ

source: Upload new member photo
ar: تحميل صورة عضو جديد

source: Villa Address
ar: عنوان الفيلا

source: Enter villa address
ar: أدخل عنوان الفيلا

source: Villa Location
ar: موقع الفيلا

source: Enter villa location
ar: أدخل موقع الفيلا

source: Street
ar: الشارع

source: Select street
ar: اختر الشارع

source: Area
ar: المساحة

source: Enter area
ar: أدخل المساحة

source: Number of Floors
ar: عدد الأدوار

source: Enter number of floors
ar: أدخل عدد الأدوار

source: Save
ar: حفظ

source: Street must be at least 3 characters
ar: يجب أن يحتوي الشارع على 3 أحرف على الأقل

# form_valid
source: Form is valid
ar: النموذج صالح

# please_fix_form_errors
source: Please fix the form errors
ar: يرجى تصحيح الأخطاء في النموذج

source: Name must be at least 2 characters
ar: الاسم يجب أن يحتوي على حرفين على الأقل

# enter_valid_phone_number
source: Enter a valid phone number
ar: أدخل رقم هاتف صحيح

# enter_valid_email
source: Enter a valid email address
ar: أدخل بريد إلكتروني صحيح

source: Password must be at least 8 characters
ar: كلمة السر يجب أن تكون 8 أحرف على الأقل

source: Villa address must be at least 5 characters
ar: عنوان الفيلا يجب أن يحتوي على 5 أحرف على الأقل

source: Villa number must be numeric
ar: رقم الفيلا يجب أن يكون رقميًا

source: Villa location must be at least 5 characters
ar: موقع الفيلا يجب أن يحتوي على 5 أحرف على الأقل

# area_must_be_valid_number
source: Area must be a valid number
ar: المساحة يجب أن تكون رقمًا صحيحًا

source: Number of floors must be numeric
ar: عدد الأدوار يجب أن يكون رقمًا

# security_guard_photo_upload
source: Upload Security Guard Photo
ar: تحميل صورة حارس الأمن

source: Enter security guard name
ar: أدخل اسم حارس الأمن

source: Enter security guard phone
ar: أدخل رقم هاتف حارس الأمن

source: Enter security guard email
ar: أدخل البريد الإلكتروني لحارس الأمن

source: Enter security guard password
ar: أدخل كلمة مرور حارس الأمن

source: Enter gate number
ar: أدخل رقم البوابة

source: Gate number must be numeric
ar: رقم البوابة يجب أن يكون رقميًا

source: Create Account
ar: إنشاء حساب

source: Members Account Statement
ar: كشف حساب الأعضاء

source: Single Member Account Statement
ar: كشف حساب عضو واحد

source: Create Voucher
ar: إنشاء سند

source: Payment Vouchers
ar: سندات الصرف

source: Receipt Vouchers
ar: سندات القبض

# enter_name
source: Please enter name
ar: أدخل الاسم من فضلك

# enter_phone
source: Please enter phone
ar: أدخل رقم الهاتف من فضلك

# enter_address
source: Please enter address
ar: أدخل عنوان الفيلا من فضلك

# enter_status
source: Please enter status
ar: أدخل الحالة من فضلك

# please_enter_date
source: Please enter the date
ar: من فضلك أدخل التاريخ

source: Address
ar: العنوان

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Account
ar: الحساب

source: Paid
ar: المدفوع

# residual
source: Remaining
ar: المتبقي

source: Year
ar: السنة

source: Voucher Date
ar: تاريخ السند

source: Currency
ar: العملة

# account_num
source: Account Number
ar: رقم الحساب

source: Creditor
ar: الدائن

source: Debtor
ar: المدين

source: Bond Explain
ar: شرح السند

source: Bond Type
ar: نوع السند

source: Receipt Bond
ar: سند قبض

source: Payment Bond
ar: سند صرف

source: Bond saved successfully
ar: تم حفظ السند بنجاح

# please_fill_required_fields
source: Please fill in the required fields
ar: يرجى ملء الحقول المطلوبة

# please_enter_bond_date
source: Please enter the bond date
ar: يرجى إدخال تاريخ السند

# please_enter_currency
source: Please enter the currency
ar: يرجى إدخال العملة

# please_enter_creditor
source: Please enter creditor name
ar: يرجى إدخال اسم الدائن

source: Please enter account number
ar: يرجى إدخال رقم الحساب

source: Please enter bond description
ar: يرجى إدخال وصف السند

source: Create Bond
ar: إنشاء سند

source: Invalid Email
ar: بريد إلكتروني غير صالح

# token
source: Verification Code
ar: رمز التحقق

source: We send you Reset link
ar: تم إرسال رابط إعادة التعيين إلى بريدك الإلكتروني

source: Change Password
ar: تغيير كلمة المرور

source: Please Enter Valid Email
ar: يرجى إدخال بريد إلكتروني صالح

source: Send Reset Password
ar: إرسال كلمة المرور الجديدة

source: Confirm Change Password
ar: تأكيد تغيير كلمة المرور

source: New Password
ar: كلمة المرور الجديدة

source: Email is required
ar: البريد الإلكتروني مطلوب

source: Invalid email format
ar: تنسيق البريد الإلكتروني غير صالح

# token_is_required
source: Verification code is required
ar: رمز التحقق مطلوب

source: Password is required
ar: كلمة المرور مطلوبة

# password_validation_message
source: Password must be at least 8 characters, include upper and lower case letters, numbers, and special characters
ar: يجب أن تحتوي كلمة المرور على 8 أحرف على الأقل، وتشمل حرف كبير وصغير ورقم ورمز خاص

# from_time_required
source: From time must be later than the current time.
ar: يجب أن يكون وقت البداية لاحقًا للوقت الحالي.

# from_before_to
source: From time must be earlier than To time.
ar: يجب أن يكون وقت البداية قبل وقت النهاية.

# to_after_now
source: To time must be later than the current time.
ar: يجب أن يكون وقت النهاية بعد الوقت الحالي.

# to_after_from_or_now
source: To time must be after the selected 'From' time or current time.
ar: يجب أن يكون وقت النهاية بعد وقت البداية أو الوقت الحالي.

# to_after_from
source: To time must be after From time.
ar: يجب أن يكون وقت النهاية بعد وقت البداية.

source: From
ar: من

source: To
ar: إلى

source: Please Select Date And Time
ar: يرجى اختيار التاريخ والوقت

source: Picture
ar: الصورة

source: Add Photo
ar: إضافة صورة

source: Gate Number
ar: رقم البوابة

source: Image
ar: الصورة الشخصية

source: Security
ar: الأمن

# action
source: Edit & Delete
ar: تعديل وحذف

source: Cancel
ar: إلغاء

source: Single
ar: أعزب

source: Married
ar: متزوج

# edit_security_guard_title
source: Edit Security Guard Information
ar: تعديل بيانات الحارس

source: Please enter numbers only
ar: الرجاء إدخال أرقام فقط

# password_required
source: Password is required
ar: كلمة المرور مطلوبة

# password_too_short
source: Password is too short (must be at least 6 characters)
ar: كلمة المرور قصيرة جدًا (يجب أن تكون 6 أحرف على الأقل)

source: Phone Number
ar: رقم الهاتف

# invalid_phone_number
source: Invalid phone number (must contain only digits and be between 10â€“15 digits)
ar: رقم الهاتف غير صالح (يجب أن يحتوي على أرقام فقط ويكون بين 10-15 رقمًا)

# invalid_gate_number
source: Invalid gate number (must contain only digits)
ar: رقم البوابة غير صالح (يجب أن يحتوي على أرقام فقط)

# password_complexity_error
source: Password must be at least 8 characters long and include an uppercase letter, a lowercase letter, a number, and a special character (e.g. ! @ # $ & * ~)
ar: كلمة المرور يجب أن تكون 8 أحرف على الأقل وتحتوي على حرف كبير، حرف صغير، رقم، ورمز خاص (مثل ! @ # $ & * ~)

source: Villa Number Is Empty
ar: رقم الفيلا فارغ

source: Edit Member Account Title
ar: تعديل حساب العضو

# update_success
source: Member account updated successfully
ar: تم تحديث بيانات العضو بنجاح

source: Amount
ar: المبلغ

# please_enter_amount
source: Please enter the amount
ar: يرجى إدخال المبلغ

# amount_must_be_numeric
source: Amount must be a number
ar: يجب أن يكون المبلغ رقمًا

source: Please select bond type and currency
ar: يرجى اختيار نوع السند والعملة

source: Villa number not found
ar: رقم الفيلا غير موجود

source: Bond created successfully
ar: تم إنشاء السند بنجاح

# receipt_bond_for_compound
source: Create Receipt Bond for the Compound
ar: إنشاء سند قبض للكمبوند

# owner_disbursement_bond_created
source: Owner Disbursement Bond Created Successfully
ar: تم إنشاء سند صرف المالك بنجاح

source: Disbursement Bond for Compound
ar: سند صرف للكمبوند

source: Create Disbursement Bond for Compound
ar: إنشاء سند صرف للكمبوند

source: Job
ar: الوظيفة

source: Account Manager
ar: مدير الحساب

source: Admin
ar: المسؤول

source: Please choose job
ar: يرجى اختيار الوظيفة

source: Add
ar: إضافة

source: Description
ar: الوصف

source: Type
ar: النوع

# disbursement
source: Disbursement Bond
ar: سند صرف

# receipt
source: Receipt Bond
ar: سند قبض

# invalid_email_password
source: Invalid Email or Password
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

source: Hello
ar: مرحبا

source: Enter villa number
ar: أدخل رقم الفيلا

source: Login successfully
ar: تم تسجيل الدخول بنجاح

# add_user_successfully
source: User added successfully
ar: تم إضافة المستخدم بنجاح

source: No users found
ar: لم يتم العثور على مستخدمين

source: Add Invitation
ar: إضافة دعوة

source: View Invitations
ar: عرض الدعوات

source: Add Security
ar: إضافة حارس أمن

source: View Security
ar: عرض حراس الأمن

source: Add Payment Voucher
ar: إضافة سند صرف

source: View Payment Vouchers
ar: عرض سندات الصرف

source: Add Receipt Voucher
ar: إضافة سند قبض

source: View Receipt Vouchers
ar: عرض سندات القبض

source: Add Account
ar: إضافة حساب

source: View Accounts
ar: عرض الحسابات

source: Add Member Statement
ar: إضافة كشف عضو

source: View All Members
ar: عرض جميع الأعضاء
